Revit 2026 API

# ElementTransformUtils Methods

---

The ElementTransformUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanMirrorElement | Determines whether element can be mirrored. |
|  | CanMirrorElements |  |
|  | CopyElement | Copies an element and places the copy at a location indicated by a given transformation. |
|  | CopyElements(Document, ICollectionElementId, XYZ) |  |
|  | CopyElements(Document, ICollectionElementId, Document, Transform, CopyPasteOptions) |  |
|  | CopyElements(View, ICollectionElementId, View, Transform, CopyPasteOptions) |  |
|  | GetTransformFromViewToView | Returns a transformation that is applied to elements when copying from one view to another view. |
|  | MirrorElement | Creates a mirrored copy of an element about a given plane. |
|  | MirrorElements |  |
|  | MoveElement | Moves one element by a given transformation. |
|  | MoveElements |  |
|  | RotateElement | Rotates an element about the given axis and angle. |
|  | RotateElements |  |

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace